programming/golang/misc.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2018-02-25 日 09:19 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>杂记</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Larry">
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">杂记</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga4bd3f3">Rob Pike, Less is More</a></li>
</ul>
</div>
</nav>


<div id="outline-container-orga4bd3f3" class="outline-2">
<h2 id="orga4bd3f3">Rob Pike, Less is More</h2>
<div class="outline-text-2" id="text-orga4bd3f3">
</div><div id="outline-container-orgaf48e03" class="outline-3">
<h3 id="orgaf48e03">Go 的设计承继</h3>
<div class="outline-text-3" id="text-orgaf48e03">
<p>
Go 以 C 为原型，以 C++ 为目标设计，最终却与两者大相径庭
</p>

<p>
作者认为
</p>

<ol class="org-ol">
<li>编写软件时应设计一门更适合解决这个问题的编程语言</li>
<li>C++ 编译慢，而标准委员会试图加入更多的新特性</li>
<li>简化 C++ 可能比加入新特性是更大的成就</li>
</ol>

<p>
作者于 80 年代设计 Newsqueak 语言，Go 的一些设计由中而来
</p>
</div>
</div>

<div id="outline-container-org8b6bf5e" class="outline-3">
<h3 id="org8b6bf5e">Go 语言特点</h3>
<div class="outline-text-3" id="text-org8b6bf5e">
<ul class="org-ul">
<li>GC</li>
<li>无头文件</li>
<li>明确的依赖，无循环依赖</li>
<li>大写可见性</li>
<li>任何类型都有方法</li>
<li>没有子类继承</li>
<li>没有类型转换</li>
<li>接口的隐式实现</li>
<li>嵌入机制</li>
<li><code>i++</code> 是 statement，而不是 expression</li>
<li>没有指针运算</li>
<li>初始化为零值</li>
<li>没有 <code>this</code></li>
<li>分段的堆栈</li>
<li>没有 static 等修饰符</li>
<li>没有异常</li>
</ul>
</div>
</div>

<div id="outline-container-orgc6016d4" class="outline-3">
<h3 id="orgc6016d4">Go vs C++/Java</h3>
<div class="outline-text-3" id="text-orgc6016d4">
<p>
C++/Java 的核心是类的层次和分类，而 Go 的核心是 composition（组合）
</p>

<blockquote>
<p>
大软件需要确定的理念，但强依赖管理、整洁的接口、抽象化以及优秀的文档工具这些更为重要！不幸的是，这些没一个是C++的强项（不过这点Java明显就好得多）。
</p>
</blockquote>

<p>
Go 中有一些特有的机制
</p>

<ul class="org-ul">
<li>slice</li>
<li>map</li>
<li>composite literal</li>
<li>top level of file</li>
<li>reflection</li>
<li>gc</li>
<li>concurrent</li>
</ul>
</div>
</div>

<div id="outline-container-org1c3d61e" class="outline-3">
<h3 id="org1c3d61e">泛型</h3>
<div class="outline-text-3" id="text-org1c3d61e">
<p>
关于 Go 的泛型问题，作者认为这可以通过类型系统来完成，而不需要额外的多态或原语
</p>
</div>
</div>


<div id="outline-container-org62f410e" class="outline-3">
<h3 id="org62f410e">为什么Go从头到尾都是以C++为目标来设计的却无法吸引到C++程序员？</h3>
<div class="outline-text-3" id="text-org62f410e">
<blockquote>
<p>
Joke认为，这可能是因为Go和C++的设计理念相差甚大吧。
</p>

<p>
C++希望所有解决方案都能很容易得到/使用。我在C++11 FAQ（常见问题）上看到了这句话：
</p>

<p>
  C++能够优美地、灵活地并且零成本地表现出抽象事物的能力，相比专门编写的代码要高效很多。
这种思考方式和Go的运转方式并不一样 。零成本不是目标，至少零CPU成本不是。Go的目标是解放程序员！
</p>

<p>
Go并没有包罗万象，你不要期待它什么都有，你也无法精确地控制每一个细节。例如：Go没有RAII，但是你可以使用一个垃圾清理器做替代，虽然你甚至无法使用内存释放函数。
</p>

<p>
你可以从Go中得到很多易于理解但是强大的工具集来组合出问题的解决方案。它跟别的语言比起来也许没有那么快或者精致，但肯定写起来更简单、读起来更容易，也更易于理解，也许还更安全。
</p>

<p>
从另一个角度看，Go肯定更加简化：
</p>

<p>
Python和Ruby程序员转向Go是因为他们不需要学更多的关心却可以获得更好的性能，甚至还可以使用并发特性。
</p>

<p>
C++程序员不愿意转向Go是因为他们竭尽全力只为了对自己的程序的完全掌控，并不希望这样改变。对于他们，软件并不仅是完成工作，而是做好工作。
</p>

<p>
现在的问题在于，如果Go成功了，会颠覆他们的世界观。
</p>

<p>
而且我们应该在一开始就注意到：对C++11新特性感兴趣的人是不会对一个功能如此简洁的语言感兴趣的，即使它能完成更多的任务
</p>
</blockquote>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Larry</p>
<p class="date">Created: 2018-02-25 日 09:19</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
